workflows/hybrid_initialization_example/0_org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    // #includeEtc "caseDicts/setConstraintTypes"
    
    vehicleGroup
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    lowerWall_upstream
    {
        type            calculated;
        value           uniform 0;
    }

    lowerWall_downstream
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    
    upperWall_upstream
    {
        type            calculated;
        value           uniform 0;
    }

    upperWall_downstream
    {
        type            calculated;
        value           uniform 0;
    }

    front_upstream
    {
        type            calculated;
        value           uniform 0;
    }

    front_downstream
    {
        type            calculated;
        value           uniform 0;
    }
    
    back_upstream
    {
        type            calculated;
        value           uniform 0;
    }

    back_downstream
    {
        type            calculated;
        value           uniform 0;
    }

}


// ************************************************************************* //
