workflows/hybrid_initialization_example/0_org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    // #includeEtc "caseDicts/setConstraintTypes"

    vehicleGroup
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    
    inlet
    {
        type  fixedValue;
        value $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    lowerWall_upstream
    {
        type            slip;
    }

    lowerWall_downstream
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    #include "include/frontBackUpperPatches"
}


// ************************************************************************* //
