workflows/hybrid_initialization_example/system/FOs/FOfieldAverage
fieldAverage
{
    // Mandatory entries (unmodifiable)
    type            fieldAverage;
    libs            (fieldFunctionObjects);

    // Mandatory entries (runtime modifiable)
    fields
    (
        p
        {
            mean        yes;
            prime2Mean  no;
            base        iteration;
        }
        U
        {
            mean        yes;
            prime2Mean  no;
            base        iteration;
       }
       k
       {
            mean        yes;
            prime2Mean  no;
            base        iteration;
       }
       omega
       {
            mean        yes;
            prime2Mean  no;
            base        iteration;
       }
       nut
       {
            mean        yes;
            prime2Mean  no;
            base        iteration;
       }
       yPlus
       {
           mean        on;
           prime2Mean  off;
           base        iteration;
       }

       wallShearStress
       {
           mean        on;
           prime2Mean  off;
           base        iteration;
       }       

    );

    // Optional entries (runtime modifiable)
    restartOnRestart    false;
    restartOnOutput     false;
    periodicRestart     false;
    restartPeriod       0.002;

    // Optional (inherited) entries
    region          region0;
    enabled         true;
    log             true;
    timeStart       100; // 500
    timeEnd         3000;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    timeStep;
    writeInterval   1; // 100 
 }
