workflows/hybrid_initialization_example/system/FOs/FOsurfaceDistance
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

surfaceDistance1
{
    // Mandatory entries
    type            surfaceDistance;
    libs            (fieldFunctionObjects);
    geometry
    {
        drivaer_4.stl
        {
            type triSurfaceMesh;
            name vehicle;
        }
    }

    // Optional entries
    calculateCells  true;

    // Optional (inherited) entries
    region          region0;
    enabled         true;
    log             true;
    //timeStart       0;
    //timeEnd         1000;
    //executeControl  writeTime;
    //executeInterval -1;
    //writeControl    writeTime;
    //writeInterval   -1;
}


// ************************************************************************* //
