workflows/hybrid_initialization_example/system/amgUzpOptions
{
    "config_version": 2,
    "solver": {
        "preconditioner": {
          "scope": "jacobi",
          "solver": "BLOCK_JACOBI",
          "monitor_residual": 0,
          "print_solve_stats": 0,
          "max_iters": 1
        },
        "solver": "PBICGSTAB",
        "print_solve_stats": 1,
        "obtain_timings": 1,
        "max_iters": 1000,
        "monitor_residual": 1,
        "store_res_history": 1,
        "convergence": "COMBINED_REL_INI_ABS",
        "scope": "main",
        "alt_rel_tolerance": 0.01,
        "tolerance": 1e-08,
        "norm": "L1_SCALED"
    }
}

