workflows/hybrid_initialization_example/system/amgxpOptions
{
    "config_version": 2,
    "min_rows_latency_hiding": 40000,
    "exact_coarse_solve": 1,
    "solver": {
        "preconditioner": {
            "scope": "amg",
            "solver": "AMG",
            "print_vis_data": 0,
            "print_grid_stats": 1,
            "print_solve_stats": 0,
            "monitor_residual": 0,
            "store_res_history": 0,
            "smoother": {
                "scope": "jacobi",
                "solver": "BLOCK_JACOBI",
                "relaxation_factor": 0.7,
                "monitor_residual": 0,
                "print_solve_stats": 0
            },
            "interpolator": "D2",
            "selector": "PMIS",
            "coarse_solver": "DENSE_LU_SOLVER",
            "aggressive_levels": 1,
            "dense_lu_num_rows": 8,
            "max_iters": 1,
            "max_levels": 25,
            "presweeps": 1,
            "postsweeps": 1
        },
        "solver": "PCG",
        "print_solve_stats": 1,
        "obtain_timings": 1,
        "max_iters": 100,
        "monitor_residual": 1,
        "store_res_history": 1,
        "convergence": "COMBINED_REL_INI_ABS",
        "alt_rel_tolerance": 0.001,
        "scope": "main",
        "tolerance": 1e-07,
        "norm": "L1_SCALED"
    }
}
