workflows/hybrid_initialization_example/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // actuationDisk1
    {
        name    vehicleVolumeCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-1.75 0 0) (2 0.75 0.75);
    }
    {
        name    vehicleVolume;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     vehicleVolumeCellSet;
    }

);


// ************************************************************************* //
